Just another discovery!

Apparently, it's related to the provider's capacity to handle parallelism (multiple connections)

running `terraform apply -parallelism=1` apparently makes this work.

```bash
$ terraform apply -parallelism=1

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.data_center.incapsula_data_center.default will be created
  + resource "incapsula_data_center" "default" {
      + id             = (known after apply)
      + is_content     = "false"
      + is_enabled     = "true"
      + name           = "data_center00"
      + server_address = "8.8.8.8"
      + site_id        = (known after apply)
    }

  # module.data_center_server["server01"].incapsula_data_center_server.default will be created
  + resource "incapsula_data_center_server" "default" {
      + dc_id          = (known after apply)
      + id             = (known after apply)
      + is_enabled     = "true"
      + is_standby     = "false"
      + server_address = "5.5.5.5"
      + site_id        = (known after apply)
    }

  # module.data_center_server["server02"].incapsula_data_center_server.default will be created
  + resource "incapsula_data_center_server" "default" {
      + dc_id          = (known after apply)
      + id             = (known after apply)
      + is_enabled     = "true"
      + is_standby     = "false"
      + server_address = "6.6.6.6"
      + site_id        = (known after apply)
    }

  # module.data_center_server["server03"].incapsula_data_center_server.default will be created
  + resource "incapsula_data_center_server" "default" {
      + dc_id          = (known after apply)
      + id             = (known after apply)
      + is_enabled     = "true"
      + is_standby     = "false"
      + server_address = "7.7.7.7"
      + site_id        = (known after apply)
    }

  # module.data_center_server["server04"].incapsula_data_center_server.default will be created
  + resource "incapsula_data_center_server" "default" {
      + dc_id          = (known after apply)
      + id             = (known after apply)
      + is_enabled     = "true"
      + is_standby     = "false"
      + server_address = "9.9.9.9"
      + site_id        = (known after apply)
    }

  # module.website.incapsula_site.default will be created
  + resource "incapsula_site" "default" {
      + acceleration_level                       = (known after apply)
      + account_id                               = "[REDACTED]"
      + active                                   = (known after apply)
      + data_storage_region                      = (known after apply)
      + dns_a_record_name                        = (known after apply)
      + dns_a_record_value                       = (known after apply)
      + dns_cname_record_name                    = (known after apply)
      + dns_cname_record_value                   = (known after apply)
      + dns_record_name                          = (known after apply)
      + domain                                   = "[REDACTED]"
      + domain_verification                      = (known after apply)
      + hash_salt                                = (known after apply)
      + hashing_enabled                          = (known after apply)
      + id                                       = (known after apply)
      + log_level                                = (known after apply)
      + naked_domain_san                         = true
      + original_data_center_id                  = (known after apply)
      + perf_client_comply_no_cache              = (known after apply)
      + perf_client_enable_client_side_caching   = (known after apply)
      + perf_client_send_age_header              = (known after apply)
      + perf_key_comply_vary                     = (known after apply)
      + perf_key_unite_naked_full_cache          = (known after apply)
      + perf_mode_https                          = (known after apply)
      + perf_mode_level                          = (known after apply)
      + perf_mode_time                           = (known after apply)
      + perf_response_cache_300x                 = (known after apply)
      + perf_response_cache_404_enabled          = (known after apply)
      + perf_response_cache_404_time             = (known after apply)
      + perf_response_cache_empty_responses      = (known after apply)
      + perf_response_cache_http_10_responses    = (known after apply)
      + perf_response_cache_response_header_mode = (known after apply)
      + perf_response_cache_response_headers     = (known after apply)
      + perf_response_cache_shield               = (known after apply)
      + perf_response_stale_content_mode         = (known after apply)
      + perf_response_stale_content_time         = (known after apply)
      + perf_response_tag_response_header        = (known after apply)
      + perf_ttl_prefer_last_modified            = (known after apply)
      + perf_ttl_use_shortest_caching            = (known after apply)
      + restricted_cname_reuse                   = (known after apply)
      + seal_location                            = (known after apply)
      + site_creation_date                       = (known after apply)
      + site_ip                                  = (known after apply)
      + wildcard_san                             = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + data_center_id                   = (known after apply)
  + data_center_instance             = {
      + id             = (known after apply)
      + is_content     = "false"
      + is_enabled     = "true"
      + name           = "data_center00"
      + server_address = "8.8.8.8"
      + site_id        = (known after apply)
      + timeouts       = null
    }
  + data_center_server_id_list       = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + data_center_server_instance_list = [
      + {
          + dc_id          = (known after apply)
          + id             = (known after apply)
          + is_enabled     = "true"
          + is_standby     = "false"
          + server_address = "5.5.5.5"
          + site_id        = (known after apply)
        },
      + {
          + dc_id          = (known after apply)
          + id             = (known after apply)
          + is_enabled     = "true"
          + is_standby     = "false"
          + server_address = "6.6.6.6"
          + site_id        = (known after apply)
        },
      + {
          + dc_id          = (known after apply)
          + id             = (known after apply)
          + is_enabled     = "true"
          + is_standby     = "false"
          + server_address = "7.7.7.7"
          + site_id        = (known after apply)
        },
      + {
          + dc_id          = (known after apply)
          + id             = (known after apply)
          + is_enabled     = "true"
          + is_standby     = "false"
          + server_address = "9.9.9.9"
          + site_id        = (known after apply)
        },
    ]
  + website_id                       = (known after apply)
  + website_instance                 = {
      + acceleration_level                       = (known after apply)
      + account_id                               = "[REDACTED]"
      + active                                   = (known after apply)
      + approver                                 = null
      + data_storage_region                      = (known after apply)
      + dns_a_record_name                        = (known after apply)
      + dns_a_record_value                       = (known after apply)
      + dns_cname_record_name                    = (known after apply)
      + dns_cname_record_value                   = (known after apply)
      + dns_record_name                          = (known after apply)
      + domain                                   = "[REDACTED]"
      + domain_redirect_to_full                  = null
      + domain_validation                        = null
      + domain_verification                      = (known after apply)
      + force_ssl                                = null
      + hash_salt                                = (known after apply)
      + hashing_enabled                          = (known after apply)
      + id                                       = (known after apply)
      + ignore_ssl                               = null
      + log_level                                = (known after apply)
      + logs_account_id                          = null
      + naked_domain_san                         = true
      + original_data_center_id                  = (known after apply)
      + perf_client_comply_no_cache              = (known after apply)
      + perf_client_enable_client_side_caching   = (known after apply)
      + perf_client_send_age_header              = (known after apply)
      + perf_key_comply_vary                     = (known after apply)
      + perf_key_unite_naked_full_cache          = (known after apply)
      + perf_mode_https                          = (known after apply)
      + perf_mode_level                          = (known after apply)
      + perf_mode_time                           = (known after apply)
      + perf_response_cache_300x                 = (known after apply)
      + perf_response_cache_404_enabled          = (known after apply)
      + perf_response_cache_404_time             = (known after apply)
      + perf_response_cache_empty_responses      = (known after apply)
      + perf_response_cache_http_10_responses    = (known after apply)
      + perf_response_cache_response_header_mode = (known after apply)
      + perf_response_cache_response_headers     = (known after apply)
      + perf_response_cache_shield               = (known after apply)
      + perf_response_stale_content_mode         = (known after apply)
      + perf_response_stale_content_time         = (known after apply)
      + perf_response_tag_response_header        = (known after apply)
      + perf_ttl_prefer_last_modified            = (known after apply)
      + perf_ttl_use_shortest_caching            = (known after apply)
      + ref_id                                   = null
      + remove_ssl                               = null
      + restricted_cname_reuse                   = (known after apply)
      + seal_location                            = (known after apply)
      + send_site_setup_emails                   = null
      + site_creation_date                       = (known after apply)
      + site_ip                                  = (known after apply)
      + timeouts                                 = null
      + wildcard_san                             = true
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.website.incapsula_site.default: Creating...
module.website.incapsula_site.default: Still creating... [10s elapsed]
module.website.incapsula_site.default: Creation complete after 13s [id=94014233]
module.data_center.incapsula_data_center.default: Creating...
module.data_center.incapsula_data_center.default: Creation complete after 2s [id=2517436]
module.data_center_server["server01"].incapsula_data_center_server.default: Creating...
module.data_center_server["server01"].incapsula_data_center_server.default: Creation complete after 1s [id=5064551]
module.data_center_server["server04"].incapsula_data_center_server.default: Creating...
module.data_center_server["server04"].incapsula_data_center_server.default: Creation complete after 2s [id=5064552]
module.data_center_server["server03"].incapsula_data_center_server.default: Creating...
module.data_center_server["server03"].incapsula_data_center_server.default: Creation complete after 2s [id=5064553]
module.data_center_server["server02"].incapsula_data_center_server.default: Creating...
module.data_center_server["server02"].incapsula_data_center_server.default: Creation complete after 1s [id=5064554]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

```
